---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
StructuralSectionAnalysisParams Constructor
StructuralSectionAnalysisParams Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | StructuralSectionAnalysisParams()()()() | Creates a new instance of StructuralSectionAnalysisParams. |
|  | StructuralSectionAnalysisParams(Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double) | Creates a new instance of StructuralSectionAnalysisParams. |

# See Also

StructuralSectionAnalysisParams Class

StructuralSectionAnalysisParams Members

Autodesk.Revit.DB.Structure.StructuralSections Namespace